Revit 2027 API
ParameterTypeId.RebarCrankLengthOverride Property
 "Override Crank Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarCrankLengthOverride { get; }
Public Shared ReadOnly Property RebarCrankLengthOverride As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarCrankLengthOverride {
	ForgeTypeId^ get ();
}
static member RebarCrankLengthOverride : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace